In [7]:
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from tqdm.notebook import tqdm_notebook
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['.ipynb_checkpoints',
 'final_results_tmdb.csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_rating.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_results_combined.csv.gz']

In [8]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:Dave05280317@localhost/movies"
engine = create_engine(connection)

In [9]:
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

In [10]:
basics = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
136200,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
136201,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
136202,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
136203,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
136204,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

In [11]:
basics = basics.replace({'\\N':np.nan})
basics.dropna(subset=['genres'], inplace=True)

In [12]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
136200,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
136201,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
136202,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,[Thriller]
136203,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"
136204,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,[Drama]

In [13]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
136201,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
136202,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
136203,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
136203,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
136204,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [15]:
unique_genres = basics['genres_split'].explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'War', 'Horror', 'Sci-Fi',
       'Mystery', 'Adventure', 'Musical', 'Action', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'Biography', 'Sport',
       'Western', 'Adult', 'Short', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [16]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [17]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [18]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [20]:
## make new integer genre_id and drop string genres
basics['genre_id'] = basics['genres_split'].replace(genre_map)
basics = basics.drop(columns='genres_split')

In [21]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [22]:
genre_lookup.to_sql('genres', engine, if_exists='replace',index=False)

26

In [23]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [24]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [25]:
title_genres = pd.DataFrame({'tconst': basics['tconst'], 'Genre_ID': genre_lookup['Genre_ID']}) # had the wrong df here? 
title_genres.head()

      tconst  Genre_ID
0  tt0035423       0.0
1  tt0062336       1.0
2  tt0069049       2.0
3  tt0079644       3.0
4  tt0088751       4.0

In [26]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()

In [27]:
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "Genre_ID": Integer()}

In [28]:
title_genres

           tconst  Genre_ID
0       tt0035423       0.0
1       tt0062336       1.0
2       tt0069049       2.0
3       tt0079644       3.0
4       tt0088751       4.0
...           ...       ...
136200  tt9916170       NaN
136201  tt9916190       NaN
136202  tt9916270       NaN
136203  tt9916362       NaN
136204  tt9916538       NaN

[136205 rows x 2 columns]

In [29]:
title_genres.to_sql('title_genres', engine, index=False, if_exists='replace', dtype=df_schema)

136205

In [30]:
engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

In [32]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  Genre_ID
0  tt0035423         0
1  tt0062336         1
2  tt0069049         2
3  tt0079644         3
4  tt0088751         4

In [33]:
basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'genres', 'genre_id'])

In [34]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [35]:
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [36]:
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

136205

In [37]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [38]:
title_basics = basics

In [39]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100

In [40]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz', low_memory=False)
title_ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1910
1        tt0000002            5.8       256
2        tt0000003            6.5      1712
3        tt0000004            5.6       169
4        tt0000005            6.2      2527
...            ...            ...       ...
1259143  tt9916690            6.5         6
1259144  tt9916720            5.1       252
1259145  tt9916730            8.4         6
1259146  tt9916766            6.8        21
1259147  tt9916778            7.2        35

[1259148 rows x 3 columns]

In [41]:
title_ratings.to_sql('title_ratings', engine, if_exists='replace',index=False)

1259148

In [42]:
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000003            6.5      1712
3  tt0000004            5.6       169
4  tt0000005            6.2      2527

In [44]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz', low_memory=False)
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.108,1961.0,PG

In [45]:
tmdb.drop(columns='adult',inplace=True)
tmdb.drop(columns='backdrop_path', inplace=True)
tmdb.drop(columns='belongs_to_collection', inplace=True)
tmdb.drop(columns='genres', inplace=True)
tmdb.drop(columns='homepage', inplace=True)
tmdb.drop(columns='id', inplace=True)
tmdb.drop(columns='original_language', inplace=True)
tmdb.drop(columns='overview', inplace=True)
tmdb.drop(columns='popularity', inplace=True)
tmdb.drop(columns='poster_path', inplace=True)
tmdb.drop(columns='production_companies', inplace=True)
tmdb.drop(columns='production_countries', inplace=True)
tmdb.drop(columns='release_date', inplace=True)
tmdb.drop(columns='runtime', inplace=True)
tmdb.drop(columns='spoken_languages', inplace=True)
tmdb.drop(columns='status', inplace=True)
tmdb.drop(columns='tagline', inplace=True)
tmdb.drop(columns='video', inplace=True)
tmdb.drop(columns='vote_average', inplace=True)
tmdb.drop(columns='vote_count', inplace=True)
tmdb.drop(columns='original_title', inplace=True)
tmdb.head()

     imdb_id      budget     revenue                 title certification
0          0         NaN         NaN                   NaN           NaN
1  tt0113026  10000000.0         0.0       The Fantasticks           NaN
2  tt0113092         0.0         0.0         For the Cause           NaN
3  tt0116391         0.0         0.0                  Gang           NaN
4  tt0118694    150000.0  12854953.0  In the Mood for Love            PG

In [46]:
tmdb.dropna(subset=['title'], inplace=True)
tmdb.isna().sum()

imdb_id             0
budget              0
revenue             0
title               0
certification    3625
dtype: int64

In [47]:
tmdb.to_sql('tmdb', engine, if_exists='replace',index=False)

4443

In [48]:
q = """SELECT * FROM tmdb LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue                 title certification
0  tt0113026  10000000.0         0.0       The Fantasticks          None
1  tt0113092         0.0         0.0         For the Cause          None
2  tt0116391         0.0         0.0                  Gang          None
3  tt0118694    150000.0  12854953.0  In the Mood for Love            PG
4  tt0118852         0.0         0.0        Chinese Coffee             R

In [49]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4             tmdb

In [51]:
title_basics.to_csv("Data/final_basics_df.csv.gz",compression='gzip',index=False)
title_ratings.to_csv("Data/final_ratings_df.csv.gz",compression='gzip',index=False)
title_genres.to_csv("Data/final_genres_df.csv.gz",compression='gzip',index=False)
tmdb.to_csv("Data/final_tmdb_df.csv.gz",compression='gzip',index=False)